graph(%0 : Float(*, 32, 4, strides=[128, 4, 1], requires_grad=0, device=cuda:0),
      %1 : Int(*, strides=[1], requires_grad=0, device=cuda:0),
      %2 : Int(*, 4, strides=[4, 1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.conv_input.0.weight : Float(3, 3, 3, 4, 16, strides=[576, 192, 64, 16, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.conv_input.1.weight : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.conv_input.1.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.conv_input.1.running_mean : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.conv_input.1.running_var : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.conv_input.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.conv1.weight : Float(3, 3, 3, 16, 16, strides=[2304, 768, 256, 16, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn1.weight : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn1.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn1.running_mean : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn1.running_var : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.conv2.weight : Float(3, 3, 3, 16, 16, strides=[2304, 768, 256, 16, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn2.weight : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn2.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn2.running_mean : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn2.running_var : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.0.bn2.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.conv1.weight : Float(3, 3, 3, 16, 16, strides=[2304, 768, 256, 16, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn1.weight : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn1.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn1.running_mean : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn1.running_var : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.conv2.weight : Float(3, 3, 3, 16, 16, strides=[2304, 768, 256, 16, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn2.weight : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn2.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn2.running_mean : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn2.running_var : Float(16, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.1.bn2.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.2.0.weight : Float(3, 3, 3, 16, 32, strides=[4608, 1536, 512, 32, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.2.1.weight : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.2.1.bias : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.2.1.running_mean : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.2.1.running_var : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer1.2.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.conv1.weight : Float(3, 3, 3, 32, 32, strides=[9216, 3072, 1024, 32, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn1.weight : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn1.bias : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn1.running_mean : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn1.running_var : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.conv2.weight : Float(3, 3, 3, 32, 32, strides=[9216, 3072, 1024, 32, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn2.weight : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn2.bias : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn2.running_mean : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn2.running_var : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.0.bn2.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.conv1.weight : Float(3, 3, 3, 32, 32, strides=[9216, 3072, 1024, 32, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn1.weight : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn1.bias : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn1.running_mean : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn1.running_var : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.conv2.weight : Float(3, 3, 3, 32, 32, strides=[9216, 3072, 1024, 32, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn2.weight : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn2.bias : Float(32, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn2.running_mean : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn2.running_var : Float(32, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.1.bn2.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.2.0.weight : Float(3, 3, 3, 32, 64, strides=[18432, 6144, 2048, 64, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.2.1.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.2.1.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.2.1.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.2.1.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer2.2.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.conv1.weight : Float(3, 3, 3, 64, 64, strides=[36864, 12288, 4096, 64, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn1.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn1.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn1.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn1.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.conv2.weight : Float(3, 3, 3, 64, 64, strides=[36864, 12288, 4096, 64, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn2.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn2.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn2.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn2.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.0.bn2.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.conv1.weight : Float(3, 3, 3, 64, 64, strides=[36864, 12288, 4096, 64, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn1.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn1.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn1.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn1.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.conv2.weight : Float(3, 3, 3, 64, 64, strides=[36864, 12288, 4096, 64, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn2.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn2.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn2.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn2.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.1.bn2.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.2.0.weight : Float(3, 3, 3, 64, 128, strides=[73728, 24576, 8192, 128, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.2.1.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.2.1.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.2.1.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.2.1.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer3.2.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.conv1.weight : Float(3, 3, 3, 128, 128, strides=[147456, 49152, 16384, 128, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn1.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn1.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn1.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn1.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.conv2.weight : Float(3, 3, 3, 128, 128, strides=[147456, 49152, 16384, 128, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn2.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn2.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn2.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn2.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.0.bn2.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.conv1.weight : Float(3, 3, 3, 128, 128, strides=[147456, 49152, 16384, 128, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn1.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn1.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn1.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn1.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.conv2.weight : Float(3, 3, 3, 128, 128, strides=[147456, 49152, 16384, 128, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn2.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn2.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn2.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn2.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.encoder_layers.encoder_layer4.1.bn2.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_middle_encoder.conv_out.0.weight : Float(3, 1, 1, 128, 128, strides=[16384, 16384, 16384, 128, 1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.conv_out.1.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.conv_out.1.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_middle_encoder.conv_out.1.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.conv_out.1.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_middle_encoder.conv_out.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.0.weight : Float(128, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.1.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.1.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.1.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.1.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.3.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.4.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.4.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.4.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.4.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.4.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.6.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.7.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.7.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.7.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.7.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.7.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.9.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.10.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.10.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.10.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.10.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.10.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.12.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.13.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.13.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.13.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.13.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.13.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.15.weight : Float(128, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.16.weight : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.16.bias : Float(128, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.0.16.running_mean : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.16.running_var : Float(128, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.0.16.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.0.weight : Float(256, 128, 3, 3, strides=[1152, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.1.weight : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.1.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.1.running_mean : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.1.running_var : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.3.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.4.weight : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.4.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.4.running_mean : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.4.running_var : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.4.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.6.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.7.weight : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.7.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.7.running_mean : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.7.running_var : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.7.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.9.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.10.weight : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.10.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.10.running_mean : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.10.running_var : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.10.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.12.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.13.weight : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.13.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.13.running_mean : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.13.running_var : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.13.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.15.weight : Float(256, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.16.weight : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.16.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_backbone.blocks.1.16.running_mean : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.16.running_var : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_backbone.blocks.1.16.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_neck.deblocks.0.0.weight : Float(256, 128, 1, 1, strides=[128, 1, 1, 1], requires_grad=1, device=cuda:0),
      %pts_neck.deblocks.0.1.weight : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_neck.deblocks.0.1.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_neck.deblocks.0.1.running_mean : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_neck.deblocks.0.1.running_var : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_neck.deblocks.0.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_neck.deblocks.1.0.weight : Float(256, 256, 2, 2, strides=[1024, 4, 2, 1], requires_grad=1, device=cuda:0),
      %pts_neck.deblocks.1.1.weight : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_neck.deblocks.1.1.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pts_neck.deblocks.1.1.running_mean : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_neck.deblocks.1.1.running_var : Float(256, strides=[1], requires_grad=0, device=cuda:0),
      %pts_neck.deblocks.1.1.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.shared_conv.conv.weight : Float(64, 512, 3, 3, strides=[4608, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.shared_conv.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.shared_conv.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.shared_conv.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.shared_conv.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.shared_conv.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.reg.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.reg.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.reg.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.reg.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.reg.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.reg.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.reg.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.reg.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.height.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.height.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.height.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.height.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.height.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.height.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.height.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.height.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.dim.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.dim.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.dim.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.dim.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.dim.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.dim.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.dim.1.weight : Float(3, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.dim.1.bias : Float(3, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.rot.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.rot.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.rot.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.rot.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.rot.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.rot.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.rot.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.rot.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.heatmap.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.heatmap.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.heatmap.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.heatmap.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.heatmap.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.heatmap.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.0.heatmap.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.0.heatmap.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.reg.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.reg.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.reg.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.reg.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.reg.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.reg.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.reg.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.reg.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.height.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.height.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.height.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.height.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.height.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.height.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.height.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.height.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.dim.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.dim.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.dim.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.dim.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.dim.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.dim.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.dim.1.weight : Float(3, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.dim.1.bias : Float(3, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.rot.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.rot.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.rot.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.rot.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.rot.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.rot.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.rot.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.rot.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.heatmap.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.heatmap.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.heatmap.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.heatmap.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.heatmap.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.heatmap.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.1.heatmap.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.1.heatmap.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.reg.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.reg.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.reg.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.reg.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.reg.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.reg.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.reg.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.reg.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.height.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.height.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.height.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.height.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.height.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.height.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.height.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.height.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.dim.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.dim.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.dim.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.dim.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.dim.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.dim.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.dim.1.weight : Float(3, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.dim.1.bias : Float(3, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.rot.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.rot.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.rot.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.rot.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.rot.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.rot.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.rot.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.rot.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.heatmap.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.heatmap.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.heatmap.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.heatmap.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.heatmap.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.heatmap.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.2.heatmap.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.2.heatmap.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.reg.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.reg.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.reg.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.reg.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.reg.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.reg.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.reg.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.reg.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.height.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.height.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.height.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.height.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.height.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.height.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.height.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.height.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.dim.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.dim.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.dim.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.dim.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.dim.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.dim.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.dim.1.weight : Float(3, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.dim.1.bias : Float(3, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.rot.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.rot.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.rot.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.rot.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.rot.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.rot.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.rot.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.rot.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.heatmap.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.heatmap.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.heatmap.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.heatmap.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.heatmap.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.heatmap.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.3.heatmap.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.3.heatmap.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.reg.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.reg.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.reg.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.reg.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.reg.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.reg.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.reg.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.reg.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.height.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.height.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.height.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.height.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.height.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.height.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.height.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.height.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.dim.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.dim.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.dim.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.dim.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.dim.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.dim.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.dim.1.weight : Float(3, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.dim.1.bias : Float(3, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.rot.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.rot.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.rot.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.rot.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.rot.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.rot.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.rot.1.weight : Float(2, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.rot.1.bias : Float(2, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.heatmap.0.conv.weight : Float(64, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.heatmap.0.bn.weight : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.heatmap.0.bn.bias : Float(64, strides=[1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.heatmap.0.bn.running_mean : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.heatmap.0.bn.running_var : Float(64, strides=[1], requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.heatmap.0.bn.num_batches_tracked : Long(requires_grad=0, device=cuda:0),
      %pts_bbox_head.task_heads.4.heatmap.1.weight : Float(1, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pts_bbox_head.task_heads.4.heatmap.1.bias : Float(1, strides=[1], requires_grad=1, device=cuda:0)):
  %54310 : Long(device=cpu) = prim::Constant[value={0}](), scope: mmdet3d.models.detectors.centerpoint.CenterPoint::/mmdet3d.models.voxel_encoders.voxel_encoder.HardSimpleVFE::pts_voxel_encoder
  %54311 : Long(device=cpu) = prim::Constant[value={9223372036854775807}](), scope: mmdet3d.models.detectors.centerpoint.CenterPoint::/mmdet3d.models.voxel_encoders.voxel_encoder.HardSimpleVFE::pts_voxel_encoder
  %54312 : Long(device=cpu) = prim::Constant[value={1}](), scope: mmdet3d.models.detectors.centerpoint.CenterPoint::/mmdet3d.models.voxel_encoders.voxel_encoder.HardSimpleVFE::pts_voxel_encoder
  %42119 : Float(21179, 32, 4, strides=[128, 4, 1], requires_grad=0, device=cuda:0) = aten::slice(%0, %54310, %54310, %54311, %54312), scope: mmdet3d.models.detectors.centerpoint.CenterPoint::/mmdet3d.models.voxel_encoders.voxel_encoder.HardSimpleVFE::pts_voxel_encoder # /home/jing/Workspace/pointcloud/mmdet3d/models/voxel_encoders/voxel_encoder.py:43:0
